---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTransitionParam
source: html/38b660b2-dbe8-b341-e32d-078e7edc0dee.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTransitionParam Property

"Transition"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurvetypeDefaultTransitionParam { get; }
```